## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault.this will be created
  + resource "azurerm_key_vault" "this" {
      + access_policy                 = (known after apply)
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "testkeyvault20110101"
      + public_network_access_enabled = false
      + purge_protection_enabled      = true
      + resource_group_name           = "test-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tenant_id                     = "58f604d3-92cf-468c-a2ce-50245986b544"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
        }
    }

  # azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "test-rg"
    }

  # module.role_assignment.azurerm_role_assignment.role_assignment[0] will be created
  + resource "azurerm_role_assignment" "role_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7e661c36-f688-424a-9e3c-e53469a0299f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.role_assignment.azurerm_role_assignment.role_assignment[1] will be created
  + resource "azurerm_role_assignment" "role_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7e661c36-f688-424a-9e3c-e53469a0299f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>